app/controllers/application_controller.rb

  def locale
    I18n.locale = params[:locale] || I18n.default_locale
    if current_user
      current_user.update!(locale: params[:locale])
---
UPDATE "users" SET "locale" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["locale", "ru"], ["updated_at", "2017-12-07 16:34:17.793949"], ["id", "7776195b-09b2-4310-bc39-2d0e1ff40f0b"]]