app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY importance ASC  [["user_id", "7776195b-09b2-4310-bc39-2d0e1ff40f0b"]]
---
  def index
    @tasks = current_user.tasks.all

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ooooo"], ["description", "Nnnnnn"], ["created_at", "2017-11-29 08:28:12.139303"], ["updated_at", "2017-11-29 08:28:12.139303"], ["user_id", 71470119]]
---
  def create
    current_user.tasks.create( task_create_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 71470119], ["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "importance" = $1, "expiry" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["importance", 111], ["expiry", "2017-01-01 00:00:00"], ["updated_at", "2017-11-29 10:10:21.816900"], ["id", 3]]
---
    task = current_user.tasks.find_by(id: params[:id])
    if task && params[:task]
      task.update!(task_update_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", "7776195b-09b2-4310-bc39-2d0e1ff40f0b"], ["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
    task = current_user.tasks.find_by(id: params[:id])
    if task
      task.destroy!

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" IS NULL LIMIT $2  [["user_id", "7776195b-09b2-4310-bc39-2d0e1ff40f0b"], ["LIMIT", 1]]
---
  def edit
    @task = current_user.tasks.find_by(id: params[:id])